pd_disagg/results/b1_matrix/raw/20260821T1918_tp2_2048x128_saturation_bench.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x76adbe28b060>, trust_remote_code=False, seed=2099, num_prompts=160, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=2048, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url=None, host='localhost', port=8100, endpoint='/v1/completions', header=None, max_concurrency=64, model='Qwen/Qwen2-7B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='results/b1_matrix/raw', result_filename='20260821T1918_tp2_2048x128_saturation_bench.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-e46c8f84-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-21 19:18:36 [utils.py:90] Sampling input_len from [2048, 2048] and output_len from [128, 128]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
100%|██████████| 160/160 [00:38<00:00,  4.16it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     160       
Failed requests:                         0         
Maximum request concurrency:             64        
Benchmark duration (s):                  38.50     
Total input tokens:                      327680    
Total generated tokens:                  20480     
Request throughput (req/s):              4.16      
Output token throughput (tok/s):         532.02    
Peak output token throughput (tok/s):    2816.00   
Peak concurrent requests:                69.00     
Total token throughput (tok/s):          9044.27   
---------------Time to First Token----------------
Mean TTFT (ms):                          3251.66   
Median TTFT (ms):                        1051.07   
P50 TTFT (ms):                           1051.07   
P90 TTFT (ms):                           9823.41   
P99 TTFT (ms):                           12785.26  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          92.61     
Median TPOT (ms):                        109.43    
P50 TPOT (ms):                           109.43    
P90 TPOT (ms):                           111.47    
P99 TPOT (ms):                           113.24    
---------------Inter-token Latency----------------
Mean ITL (ms):                           92.61     
Median ITL (ms):                         19.93     
P50 ITL (ms):                            19.93     
P90 ITL (ms):                            210.75    
P99 ITL (ms):                            215.82    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          15012.50  
Median E2EL (ms):                        14974.57  
P50 E2EL (ms):                           14974.57  
P90 E2EL (ms):                           23950.54  
P99 E2EL (ms):                           26948.27  
==================================================